function setup() {
  createCanvas(600, 400);
}

function draw() {
  background(245);
  noStroke();

  // 목
  fill(255, 220, 200);
  rect(280, 230, 40, 40);

  // 몸통
  fill(30);
  rect(150, 270, 300, 130, 4);

  // 귀
  fill(255, 220, 200);
  ellipse(220, 155, 40, 40);
  ellipse(380, 155, 40, 40);

  // 얼굴
  fill(255, 220, 200);
  ellipse(300, 150, 180, 200);

  // 에어팟
  fill(255);
  ellipse(209, 155, 11, 16); // 왼쪽 본체
  rect(205, 160, 7, 16, 4); // 왼쪽 줄기

  ellipse(392, 155, 11, 16); // 오른쪽 본체
  rect(388, 160, 7, 16, 4); // 오른쪽 줄기

  // 눈썹
  stroke(60, 40, 30);
  strokeWeight(8);
  line(245, 142, 275, 142);
  line(325, 142, 355, 142);

  // 머리
  noStroke();
  fill(40, 30, 20);
  arc(300, 130, 200, 180, PI, TWO_PI);

  // 파마선
  noFill();
  stroke(70, 55, 40);
  strokeWeight(3);
  bezier(286, 50, 205, 78, 210, 98, 228, 112);
  bezier(292, 50, 230, 78, 235, 96, 252, 111);
  bezier(297, 50, 260, 78, 262, 96, 278, 110);
  bezier(300, 50, 292, 78, 294, 96, 300, 110);
  bezier(303, 50, 340, 78, 338, 96, 322, 110);
  bezier(308, 50, 370, 78, 365, 96, 348, 111);
  bezier(314, 50, 395, 78, 390, 98, 372, 112);

  // 눈
  noStroke();
  fill(40, 30, 20);
  circle(260, 160, 10);
  circle(340, 160, 10);

  // 코
  stroke(160, 130, 120);
  strokeWeight(2);
  line(300, 175, 295, 195);
  line(295, 195, 305, 198);

  // 입
  noFill();
  stroke(150, 80, 80);
  strokeWeight(3);
  arc(300, 210, 50, 30, 0, PI);
}
